## 路由器

是连接不同网络或不同网段的设备

```
路由器--将局域网接入互联网（不同网段）
        \一般将路由器的端口接收到的数据转发到另一个端口
        路由表--记录了到达各网络的方法，路由器根据路由表转发数据
三层交换机--连接不同vlan（vlan之间互通）
```

路由器接口

```
1、局域网接口：E（十M）、fa（百M）、g（千M）
2、广域网接口
```

> PC连接路由器使用交叉线

---

### 配置端口IP地址

指定接口（交换机是从1开始第一个接口，路由器是从0开始第一个接口）

```
name(config)# interface fastethernet 0/0
```

指定IP及掩码，并激活端口

```
name(config-if)# ip address 192.168.0.1 255.255.255.0
name(config-if)# no shutdown
```

---

### 配置远程登陆指令

```
name(config)# line vty 0 4
name(config-line)# password aaaa
name(config-line)# login
```

---

### 配置路由特权密码

```
name(config)# enable secret aaaa
```

> 使用上面三个步骤，可使路由进入远程telnet

---

### 路由配置模式（路由器比交换机多一个模式）

手工加入静态路由表

```
name# show ip route
name(config)# ip route 192.168.0.0 255.255.255.0 fa0/0
                       网络编号     子网掩码        本地接口/吓一跳路由直连接口的ip地址
```

客户机的默认网关为最接近客户机的路由器接口IP，且IP和网关在同一个网段

静态路由用于网段数量很少的网络

---

### rip动态路由

启用rip协议，并定义版本

```
name(config)# route rip
name(config-route)# version 2
```

申明本设备直连的网段

```
name(config-route)# network 12.0.0.0
name(config-route)# network 192.168.2.0
```

> rip一般每隔30s发布一次更新，最大可用于15个跳数

---

### ospf动态路由

启用ospf协议，并指定进程号为10

```
name(config)# route ospf 10
```

指定第0（零）号区域，在同一个区域会自动学习

```
name(config-route)# network 192.168.0.0 0.255.255.255 area
name(config-route)# network 192.168.1.0 0.255.255.255 area
                            IP          子网掩码的反码  代表0(零）
```

> 端口号：0~1023常用于服务器，1024~常用于客户机
